17248
26653
2465
3280
4200
17640
191
192
20580
3878
105
28428
3340
8041
174
18095
4815
7678
7708
4618
19823
7659
28803
963
22699
27495
4063
6307
8116
3428
7673
5112
216
23674
136
22725
28419
27420
27423
6376
27468
2501
18159
28405
18221
21850
18063
917
3260
21744
5736
28317
5709
23650
8046
25393
466
16138
22032
27446
7865
7505
2434
21666
22695
17225
2523
25462
17488
16272
4169
17358
1371
3446
28406
20442
12748
17146
260
3139
22854
205
18446
18046
4059
21811
28604
23721
18120
17366
6299
24618
21837
15253
2457
16142
7182
1581
22754
23664
7543
16227
16299
184
18117
26485
18148
21887
17873
1560
18271
10443
28548
7644
14355
12904
23720
6355
18066
18874
25406
13630
8915
9589
18885
215
26467
404
25379
16171
21748
18824
819
7100
16220
10338
7151
4054
8859
7494
19816
4488
28437
7116
9518
21662
8908
4626
3363
240
18872
18124
11085
7564
6336
7780
8851
17098
3134
16160
4306
17118
848
15317
3803
13690
22718
852
156
18088
23769
19013
3471
6870
17117
27436
2481
2611
28418
12757
26480
16178
18147
7657
811
16243
17158
22703
25399
19824
3490
7332
198
394
17262
312
7484
7502
2516
22743
25378
4099
19885
3768
828
813
12910
7117
2436
4275
3500
22819
10347
159
21663
253
2672
12760
7136
21736
25369
4078
12836
8900
27478
18837
7647
19313
26711
28358
6273
26608
3415
26518
9512
23655
18187
22724
19017
5724
133
2447
7835
24487
7627
18875
4328
18113
3293
16291
26493
1528
267
2428
17989
25444
20242
27457
18964
25384
843
8028
8941
3581
2572
4460
12810
4329
16166
17196
21812
5126
7192
13614
17189
22738
5219
18906
8037
23666
7154
3405
7470
3374
356
6384
24701
16264
3751
2657
17352
6648
21675
17112
3633
5808
12759
15248
23731
2427
15263
28314
24478
23684
23728
4296
1555
21711
26634
4140
4413
102
194
15316
17264
6303
28577
2693
4363
6367
364
23716
6326
4314
15246
17338
22721
21668
22715
22719
12761
7140
19944
22778
28465
24534
26602
8283
3440
19143
28362
3424
19936
8272
17283
7669
20123
440
23153
3999
6339
23668
13624
304
26457
26482
3304
7645
28423
4703
7527
10354
9718
18153
5159
22875
109
7580
2549
28587
3349
6446
15275
28430
3654
2464
17508
25372
13607
19880
17119
12765
7749
17270
15278
18101
7539
4360
16163
27469
8875
18112
17293
187
231
14347
3388
15332
7183
19850
18963
4295
22768
24488
17113
17733
26531
23073
7472
19893
17441
21714
28352
13600
3468
7701
5135
5117
13428
18142
24558
16515
19859
16545
17207
3744
4053
4057
2511
6636
5115
16151
2591
8095
14340
28755
129
25407
12753
935
8952
19817
3711
4388
17210
6362
268
7587
6313
21713
13765
16310
6185
22860
16214
5102
16168
8909
25375
12733
27437
3489
239
3355
28553
18134
17177
3285
10735
7276
4278
4302
22773
18193
19884
21730
7135
4386
5762
17260
6291
7177
8885
3302
1558
7610
14334
3272
7613
19862
28664
273
27425
15260
3334
2487
3265
18103
2606
10353
209
16124
21670
1546
16192
18055
28581
5120
6411
4387
18122
25416
9552
28615
18870
2533
20564
10366
3337
21770
3161
7150
18834
26483
18836
1668
2488
17183
7222
3242
2449
16244
162
8042
19827
10360
27438
12939
3512
4196
18052
8073
1593
13662
26600
3509
826
2517
18807
4471
20274
3406
2423
19812
863
26471
20283
26466
13616
4281
4359
157
29030
16297
23005
16372
5143
2602
18218
3187
3583
7510
114
24512
823
5119
17221
13634
26469
18094
27456
458
13628
6330
201
2783
281
362
22701
25397
5122
8854
24474
4312
16085
20563
26513
189
21700
4343
7465
6467
17161
3382
1573
3227
7498
26561
7728
13625
14360
26486
17341
27419
18057
2445
196
28421
9549
2659
387
8099
22130
430
16141
28462
24528
12795
224
16322
26603
28332
4203
6429
21765
20290
19839
147
18098
17334
22767
16374
28413
26465
28379
7528
7813
4199
19864
3261
3364
25385
16238
28321
16311
3566
10718
7152
7440
13663
16242
25433
4270
18939
16086
27479
16118
6478
26470
21654
15268
108
3230
4433
22745
18167
9519
350
21691
20570
15250
5284
22727
4118
121
26501
18979
3372
8921
17152
8031
28311
4102
16130
4052
6660
13632
2452
8920
3822
19825
2443
3237
9516
17768
6679
7516
21693
20005
4409
220
8067
7560
22751
19986
7525
28616
18137
3294
2439
7109
3729
24582
23128
21686
26550
10343
8077
21702
4316
7490
3412
5105
24667
16215
21673
12820
18173
18192
3275
3356
7452
18109
26528
28386
7747
13780
17144
14342
5720
235
1538
23663
7758
3193
4197
23873
4320
3369
170
7877
20503
19841
4060
4420
8032
18171
3185
2433
27422
13612
5605
4129
1532
23679
3990
7163
279
6370
18980
16461
13668
246
2502
7173
16179
28351
26515
17611
21731
825
22712
23772
4064
142
3519
24524
3806
16231
13651
7160
18056
7858
8862
4095
25370
3552
1530
25386
4204
207
18822
3527
18814
28546
4103
8160
2444
3348
28345
28361
28575
12766
17365
16217
22750
8887
17136
8105
26579
26463
3236
21655
2486
22711
22758
8131
7956
4018
21723
13822
26714
5147
12731
22898
3196
17170
23706
7157
21659
3286
8081
4342
19838
23665
12773
9618
3442
22708
28442
28319
12711
2532
6366
4167
28316
7138
17094
18125
5108
3682
18907
26490
13615
1070
24502
13673
27429
17238
13923
8038
7361
3368
3890
18891
26643
13691
2575
15272
18115
21767
21705
138
21737
12724
12737
16093
7475
7145
12794
22791
9684
8874
21698
834
3671
17219
18051
18146
17109
18911
26473
22925
4790
23645
21676
24554
12787
6298
21717
7683
16193
4307
7126
20602
7115
7655
22764
4414
3956
7112
23669
3427
22913
18132
23686
3772
22851
18909
22774
5129
18953
842
8075
4285
23159
415
19933
128
24519
27441
25413
18863
13635
9602
13646
19911
28432
10712
13631
7576
10350
22853
875
25376
4336
21781
951
21710
22736
18081
21752
3234
8179
366
28312
237
16282
21704
772
524
5180
22824
26452
16294
4340
16158
12847
127
5309
18119
2669
6286
5729
8163
2571
9511
2441
7120
25395
8159
2451
7552
21734
12732
3939
3510
7128
4192
22763
14362
15302
17135
3251
21761
21757
28460
21719
15241
22704
22755
286
22894
21715
26476
8346
2490
4293
7828
18862
293
2707
3759
22928
6309
13929
167
5111
25373
19867
28356
7467
7495
18265
26522
17075
7551
163
4170
4287
4055
7144
26824
13669
5749
16239
9524
7119
10359
18815
3252
311
8263
25402
19808
8086
13682
7512
3697
7190
6704
22716
18189
850
8033
20591
28302
4335
28339
17184
7252
20109
8153
13621
6502
2484
2565
8064
165
21683
16162
10352
25366
889
16815
190
16107
16159
12786
297
8072
4195
16276
26510
16410
26491
6654
4268
26459
2553
7169
24486
25419
10372
3217
7581
15282
125
7607
28449
19012
28355
8065
26538
27432
814
17093
6426
2492
27450
5113
2456
4089
7540
25479
27431
4382
7473
17234
16404
6327
16102
22748
3358
16143
7493
8062
22694
12775
22753
18049
8121
20547
17100
22835
19915
7615
3308
18169
6409
8881
8234
3686
16562
179
303
401
22761
3523
7466
7489
6322
27426
318
26484
21786
8863
4274
13768
7491
17138
1542
17598
2542
7301
4596
7733
3215
7621
5896
7262
3663
21823
13729
7651
11083
18903
28675
3576
7779
2438
17453
17333
7113
22705
28458
4389
25437
2459
17090
7174
15369
2498
21677
164
20199
17169
19800
2442
21660
18951
16202
15276
15281
25389
22866
4127
27417
27434
15299
22734
20209
4271
3283
7433
13597
26504
28336
26512
28424
2426
19799
158
4097
21656
3592
10377
24510
28320
23719
3571
21669
16262
2454
12961
27502
4979
10384
7479
3896
7110
28412
19949
4454
10719
4332
3823
18913
16283
2551
248
7139
24516
16137
3263
24535
4613
7537
3898
28337
7760
434
202
25422
7141
28454
4056
22732
17167
18127
7501
16183
17101
7167
4366
7130
3352
26500
26475
28529
18105
21680
23190
22730
4308
810
4166
4284
8910
21758
27444
16512
7471
7349
3826
7726
3518
17473
230
16941
925
2475
6378
7571
22788
3916
12772
16120
16194
3560
4379
13637
25412
3661
4609
6730
7159
12814
12762
25381
26453
24540
20565
8903
5130
18867
5752
28443
5711
2468
12770
12771
23675
24498
23690
8864
7233
18061
7102
15586
4211
21724
2752
3460
28376
5136
25473
23011
16175
3674
18097
213
28505
8080
2470
236
4333
22823
28714
3441
16275
5116
7240
379
6595
3480
19257
19886
7424
16097
7108
19960
18251
28538
10341
12745
16218
3206
19826
16154
15304
16251
3479
5301
25460
27453
18851
28324
18141
21701
28329
2499
7106
8141
4072
18207
1550
25440
18916
3203
8897
22726
3303
3623
9543
16274
22891
2535
20583
7104
3366
27433
3332
26474
17596
3274
10489
13599
13613
20569
18027
252
19805
6332
21665
28377
18060
19865
10345
206
8898
28392
18805
15264
7103
7200
7517
6317
8225
21806
13696
12746
19828
22998
3313
22820
17235
22806
417
17368
5140
6276
19010
20552
21671
14351
302
24492
2466
4318
17218
18161
7600
6394
28322
11087
3753
22800
13931
22707
3731
8101
2640
8279
391
5282
9513
146
14376
3461
4049
25458
7695
22776
17162
280
3472
3113
851
18110
16234
3310
287
339
21682
19852
16100
18065
22749
16293
2471
9570
3450
24518
16189
7690
4371
28451
28790
7068
2522
19971
17165
3362
4315
26516
16174
16285
4201
18026
18847
16165
13640
26456
5189
28331
7186
2467
12758
16117
914
18897
7156
25377
3246
28427
13611
26718
3288
14350
20571
22720
3216
3281
22914
7132
1539
3718
21685
3501
15331
16153
241
18210
26460
7519
17198
3173
8269
28309
4311
28464
5710
5715
4344
397
24481
7504
13364
8880
7275
2505
25424
8861
5391
119
2460
4818
18133
16252
8090
7335
7642
18818
28315
26502
7626
22939
17217
8849
7131
970
406
228
19834
22792
4345
18952
16373
7488
4408
113
13769
8944
21771
7496
10394
7676
178
3507
12791
305
1552
15336
17206
16240
5740
3324
7486
13684
7686
9510
2424
19507
16462
4267
3295
12781
21953
1006
6715
310
161
5118
3326
21697
28708
7503
8093
9634
8074
23700
18085
3380
893
8039
25392
7563
24491
15312
3354
13655
18868
12928
332
2538
8945
25408
7716
2524
18887
28613
6300
3481
4321
5814
22896
6568
3307
18106
4635
28745
26547
4622
25470
23697
182
15310
341
145
18102
20551
20562
98
23018
4401
132
10378
18071
6278
204
6408
10393
1537
6677
28305
17148
25468
18275
13606
28668
3665
3419
24497
3423
28439
7162
908
3629
818
3780
12858
7570
22728
17398
16644
13623
26455
16111
20561
21684
8102
4291
559
25391
22756
7178
20587
16129
13730
23750
18901
8852
8085
21692
28357
16106
28360
7165
549
6496
16791
17186
16580
315
4279
2500
5114
3485
6353
17202
344
19878
22752
7482
8045
16577
8034
17133
18188
222
20573
9580
6594
28491
12768
22760
28448
18858
4061
18075
15296
7371
27443
5717
2462
126
23767
26472
918
3452
26505
8142
13610
2491
2422
8870
16105
13601
9522
25439
15234
28307
16277
8076
3247
3282
275
19244
581
9564
26462
22974
23164
10711
17444
17125
16110
18877
21783
5121
18972
18096
26535
22731
26495
10730
24521
21687
18842
8949
7485
8082
13807
5107
22910
13602
3292
25472
28306
19019
7544
16095
4355
5103
7123
1563
7593
796
24562
11086
5714
2446
3350
13629
4038
19806
12728
21672
328
2435
16528
17171
15287
17139
4096
15403
4190
3306
17278
172
149
19811
837
5833
3520
22746
359
879
940
16300
13783
20579
28333
12813
24496
10362
2450
21712
14349
21708
4330
22777
17253
8242
28563
22729
17175
7840
18855
21674
3614
4936
8040
25368
7507
28431
3546
2577
27421
28383
5725
18890
26619
23656
7596
28340
21688
18871
9547
21739
4421
4323
7756
26461
17116
7714
16190
26607
22766
25414
12797
3169
5775
26530
24503
8886
4317
221
4653
6980
13638
17102
3339
16208
3683
3378
24480
8106
15329
18150
12741
3596
16246
20364
24508
28561
337
18155
16176
24494
26572
3168
7612
21789
15257
7111
19868
7609
2448
26520
27476
16863
8070
4378
18266
13786
19452
2595
13314
13648
5110
4073
12743
3311
439
12749
5712
19855
259
17229
3750
6383
22713
276
18131
16755
18845
24482
28411
5082
18059
23691
4067
18058
4048
1587
28467
3429
22709
19860
3105
18918
7761
7933
12933
7661
4365
3407
28303
171
173
12776
17389
4191
12726
21689
17195
12852
21695
7148
14354
8035
8036
21716
28896
21735
982
28746
13598
16479
22765
3221
3766
3156
24511
7143
21760
3462
675
7210
2430
18073
296
21679
16379
20453
3320
3492
28599
12863
17115
16139
12755
3400
17351
7137
7989
10348
7480
6290
8087
4276
22905
12986
18070
258
27448
18861
21661
17188
3732
18080
17987
18045
23179
13764
857
28378
3599
203
22837
28353
8857
10722
19982
939
2518
23694
7282
16557
16219
23657
4110
22934
9539
19836
3618
9527
13652
8911
12906
7105
6629
8927
17321
3386
185
7124
1562
8856
326
18084
22700
10707
8144
14369
20558
10340
16147
18089
868
10713
820
3392
22796
2576
5701
3421
12905
12832
3255
3367
19814
3484
17121
21681
8865
18826
15314
17176
7469
6908
7572
26542
4309
8951
4324
18819
7727
12751
17708
25401
264
13644
18144
5109
20033
7175
3542
4417
10369
17110
16169
8855
21658
27458
14000
17882
18072
18849
26554
21694
7101
15301
21725
17427
8044
4681
27439
27407
16161
22714
15289
4305
4224
6681
21664
23309
25382
23671
392
25403
2432
16005
2483
28480
23649
6542
23695
8890
18050
16113
7679
4282
12714
4062
2478
17128
19918
21720
28363
5726
26668
6562
17103
18943
3459
856
3488
25374
849
7134
20272
13719
5716
16257
137
181
24504
251
420
3667
17224
197
16422
5962
1610
10365
16109
4350
25380
13642
18856
7146
16255
3724
17089
5924
3266
21746
5101
26546
19983
4283
1534
141
21842
27459
130
18941
13659
984
16128
20559
19925
16112
8043
24490
14335
22897
18829
12747
14344
812
28325
15277
3741
7589
22742
3195
19876
16226
495
16121
7542
10724
17492
18820
24500
8873
3357
4193
19323
12739
22744
12892
20560
26498
2485
7663
7514
26521
4422
4375
17099
5228
384
17239
7696
17190
19797
13639
28389
17153
2509
16347
22845
25400
7114
4322
18830
22983
10403
28341
16228
323
5713
3249
15291
5133
16366
3098
120
6279
177
7224
7864
15271
24127
4037
13633
3796
4331
26533
17155
7468
2476
5438
28515
186
28394
7573
27506
3218
16584
18859
9572
4198
7500
23642
22892
7133
6311
24493
28371
8115
23015
13603
20557
26477
23654
7118
832
23673
7757
17092
3547
26639
160
4075
18104
28407
18983
16263
17126
16131
28335
18086
28359
208
17180
860
18076
3170
17108
1531
17785
12788
23047
10342
16527
23756
18896
294
21822
881
21763
16203
26716
7521
2494
7179
28612
7605
27445
14346
13620
16188
17780
2546
19975
8068
17288
8071
18108
6310
5123
22043
17185
21706
1297
17084
7773
15239
4513
16119
4338
21964
89
28391
23641
28370
25371
13704
180
19819
3338
22794
4058
24509
19840
22710
1675
13091
20577
18135
22810
3381
7386
16351
7239
13714
6287
7481
8866
18889
3425
6556
7099
3229
7067
28365
122
6334
17626
262
8872
19218
217
24532
17413
227
3335
13595
8078
18798
4447
29033
19928
3539
5328
22923
6297
830
18197
15997
16185
16134
4294
13785
18893
3702
13485
7520
26478
3241
4372
22786
2493
12744
7125
7476
21726
17156
445
7625
18129
6441
8063
3256
7811
8100
6359
22831
3289
3695
3506
22809
168
19924
28475
5732
19854
3585
4250
1551
7553
15273
13032
28471
18833
870
176
3330
4664
10370
7153
23764
19964
8253
6280
27487
28395
7358
19137
13781
12815
115
474
148
226
23667
28304
13676
17082
815
13681
3467
25448
403
7122
26508
8871
26479
15364
25388
5719
7060
25450
469
4341
212
10715
2540
14333
5134
3646
3473
7684
3801
2482
27462
18846
22717
16127
2513
427
18803
28369
12851
3158
13605
18090
23751
166
7536
5131
26519
18114
21844
23688
28551
7763
21718
937
23009
9621
2431
3211
330
28330
13656
26487
8027
7382
13596
18100
19118
18869
17111
4066
4352
18817
27454
13641
3950
12742
3327
28444
16222
124
22735
20445
7184
10385
28366
17087
16145
20014
8158
28343
5735
10349
15252
20585
9627
25410
17243
7658
8850
12980
28614
5125
18079
27440
3204
4286
12809
3238
15323
1576
23678
19820
22838
19887
24513
4393
864
24495
3776
19995
16187
28482
3627
23680
28349
1009
27428
19802
28310
2429
17205
4383
21743
3643
4074
13823
1529
8877
5811
4033
278
25426
17567
3465
8867
6357
16099
6449
22723
4367
9551
7522
24517
7599
19847
5127
5299
7534
7547
946
14338
17236
18813
7268
28922
22789
16213
6093
5722
20542
17197
175
16253
284
10355
15269
3389
3536
13622
22779
335
16223
16126
18068
199
17396
28445
7198
2440
10773
28374
17142
7497
3300
5774
18823
5104
8029
135
13495
8905
7646
8860
4070
4298
3543
8270
5216
346
26464
28346
28812
7624
17097
13619
3416
22771
22795
6318
17157
4087
21740
277
4202
15232
7639
13604
16258
3322
13721
7176
3370
7107
4304
28384
24531
5389
8066
12793
27466
23659
3478
933
835
12750
6610
369
8893
5226
7518
4364
3259
28347
17880
6282
8069
7172
22772
16149
16091
21728
23343
3290
22807
3443
2477
17349
9545
405
7832
6386
28338
9535
4280
12873
7155
18179
329
21832
8112
28530
3733
21787
20009
28549
22942
2463
4358
23035
18151
4297
4065
4657
17096
829
7598
18083
210
6345
21780
20122
15998
977
21703
12824
8929
8030
27460
6281
4310
3556
28400
14345
3375
27461
4403
10346
8284
4213
12948
16150
13618
4301
1269
5566
2489
22733
18054
28700
16453
21699
22979
7189
17458
2495
16559
13678
21774
8098
4411
18048
26499
25390
844
16003
20426
10721
19007
28570
6304
18899
